oltp_point_select_baseline.log
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 32
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 32 tps: 8536.46 qps: 8536.46 (r/w/o: 8536.46/0.00/0.00) lat (ms,99%): 7.30 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 32 tps: 7476.90 qps: 7476.90 (r/w/o: 7476.90/0.00/0.00) lat (ms,99%): 11.65 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 32 tps: 8698.83 qps: 8698.83 (r/w/o: 8698.83/0.00/0.00) lat (ms,99%): 7.43 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 32 tps: 9077.74 qps: 9077.74 (r/w/o: 9077.74/0.00/0.00) lat (ms,99%): 6.91 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 32 tps: 9138.69 qps: 9138.69 (r/w/o: 9138.69/0.00/0.00) lat (ms,99%): 6.67 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 32 tps: 9070.32 qps: 9070.32 (r/w/o: 9070.32/0.00/0.00) lat (ms,99%): 6.91 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 32 tps: 9067.34 qps: 9067.44 (r/w/o: 9067.44/0.00/0.00) lat (ms,99%): 7.04 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 32 tps: 8773.87 qps: 8773.77 (r/w/o: 8773.77/0.00/0.00) lat (ms,99%): 7.17 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 32 tps: 9089.59 qps: 9089.59 (r/w/o: 9089.59/0.00/0.00) lat (ms,99%): 6.91 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 32 tps: 9115.04 qps: 9115.04 (r/w/o: 9115.04/0.00/0.00) lat (ms,99%): 6.91 err/s: 0.00 reconn/s: 0.00
Latency histogram (values are in milliseconds)
       value  ------------- distribution ------------- count
       1.227 |                                         1
       1.295 |                                         2
       1.319 |                                         2
       1.343 |                                         4
       1.367 |                                         6
       1.392 |                                         3
       1.417 |                                         9
       1.443 |                                         4
       1.469 |                                         11
       1.496 |                                         21
       1.523 |                                         25
       1.551 |                                         37
       1.579 |                                         39
       1.608 |                                         63
       1.637 |                                         94
       1.667 |                                         107
       1.697 |                                         164
       1.728 |                                         202
       1.759 |                                         240
       1.791 |                                         317
       1.824 |*                                        433
       1.857 |*                                        583
       1.891 |*                                        672
       1.925 |*                                        817
       1.960 |*                                        1055
       1.996 |**                                       1183
       2.032 |**                                       1593
       2.069 |***                                      1910
       2.106 |***                                      2256
       2.145 |****                                     2763
       2.184 |****                                     3232
       2.223 |*****                                    3901
       2.264 |******                                   4478
       2.305 |*******                                  5143
       2.347 |********                                 6062
       2.389 |*********                                6834
       2.433 |***********                              7955
       2.477 |*************                            9144
       2.522 |**************                           10341
       2.568 |****************                         11678
       2.615 |******************                       12912
       2.662 |********************                     14626
       2.710 |**********************                   16168
       2.760 |************************                 17542
       2.810 |**************************               19031
       2.861 |****************************             20743
       2.913 |******************************           22069
       2.966 |********************************         23597
       3.020 |**********************************       25000
       3.075 |************************************     26255
       3.130 |*************************************    27045
       3.187 |**************************************   28016
       3.245 |***************************************  28448
       3.304 |**************************************** 29223
       3.364 |**************************************** 29088
       3.425 |***************************************  28855
       3.488 |***************************************  28562
       3.551 |**************************************   28053
       3.615 |*************************************    27319
       3.681 |************************************     26440
       3.748 |**********************************       24856
       3.816 |*********************************        23864
       3.885 |*******************************          22450
       3.956 |*****************************            21272
       4.028 |***************************              20073
       4.101 |*************************                18579
       4.176 |***********************                  17120
       4.252 |*********************                    15534
       4.329 |********************                     14373
       4.407 |******************                       13213
       4.487 |****************                         11879
       4.569 |***************                          10662
       4.652 |*************                            9776
       4.737 |************                             8761
       4.823 |***********                              7926
       4.910 |**********                               6985
       4.999 |*********                                6426
       5.090 |********                                 5678
       5.183 |*******                                  5442
       5.277 |*******                                  4770
       5.373 |******                                   4073
       5.470 |*****                                    3794
       5.570 |*****                                    3449
       5.671 |****                                     3104
       5.774 |****                                     2851
       5.879 |****                                     2564
       5.986 |***                                      2317
       6.095 |***                                      2059
       6.205 |***                                      1979
       6.318 |***                                      1828
       6.433 |**                                       1625
       6.550 |**                                       1486
       6.669 |**                                       1366
       6.790 |**                                       1279
       6.913 |**                                       1185
       7.039 |**                                       1106
       7.167 |*                                        952
       7.297 |*                                        922
       7.430 |*                                        806
       7.565 |*                                        712
       7.702 |*                                        620
       7.842 |*                                        655
       7.985 |*                                        566
       8.130 |*                                        538
       8.277 |*                                        517
       8.428 |*                                        455
       8.581 |*                                        466
       8.737 |*                                        427
       8.895 |*                                        389
       9.057 |                                         362
       9.222 |                                         275
       9.389 |                                         261
       9.560 |                                         249
       9.734 |                                         249
       9.910 |                                         241
      10.090 |                                         213
      10.274 |                                         203
      10.460 |                                         212
      10.651 |                                         163
      10.844 |                                         155
      11.041 |                                         155
      11.242 |                                         114
      11.446 |                                         146
      11.654 |                                         113
      11.866 |                                         89
      12.081 |                                         88
      12.301 |                                         79
      12.524 |                                         79
      12.752 |                                         71
      12.984 |                                         52
      13.219 |                                         53
      13.460 |                                         59
      13.704 |                                         58
      13.953 |                                         51
      14.207 |                                         44
      14.465 |                                         45
      14.728 |                                         32
      14.995 |                                         37
      15.268 |                                         27
      15.545 |                                         16
      15.828 |                                         24
      16.115 |                                         17
      16.408 |                                         17
      16.706 |                                         19
      17.010 |                                         15
      17.319 |                                         22
      17.633 |                                         16
      17.954 |                                         23
      18.280 |                                         28
      18.612 |                                         27
      18.950 |                                         22
      19.295 |                                         14
      19.645 |                                         7
      20.002 |                                         9
      20.366 |                                         11
      20.736 |                                         15
      21.112 |                                         10
      21.496 |                                         4
      21.886 |                                         5
      22.284 |                                         4
      22.689 |                                         12
      23.101 |                                         8
      23.521 |                                         7
      23.948 |                                         2
      24.384 |                                         6
      24.827 |                                         3
      25.278 |                                         1
      25.737 |                                         3
      26.205 |                                         6
      26.681 |                                         6
      27.165 |                                         2
      27.659 |                                         1
      28.162 |                                         1
      29.725 |                                         3
      30.265 |                                         1
      30.815 |                                         4
      31.375 |                                         7
      31.945 |                                         3
      32.525 |                                         1
      33.116 |                                         5
      33.718 |                                         2
      36.894 |                                         3
      39.650 |                                         1
 
SQL statistics:
    queries performed:
        read:                            880493
        write:                           0
        other:                           0
        total:                           880493
    transactions:                        880493 (8803.79 per sec.)
    queries:                             880493 (8803.79 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          100.0115s
    total number of events:              880493

Latency (ms):
         min:                                    1.22
         avg:                                    3.63
         max:                                   39.80
         99th percentile:                        7.70
         sum:                              3194460.83

Threads fairness:
    events (avg/stddev):           27515.4062/49.26
    execution time (avg/stddev):   99.8269/0.00